In [5]:
import numpy as np
import pandas as pd

df = pd.read_csv('advertising_simple.csv')
df.describe()

               TV      Radio  Newspaper      Sales
count    8.000000   8.000000   8.000000   8.000000
mean    73.125000  29.500000  42.500000  11.250000
std     68.059716  17.146428  27.619869   4.334249
min      8.000000   2.000000   1.000000   4.000000
25%     14.750000  16.750000  20.000000   9.250000
50%     50.500000  35.500000  51.500000  11.500000
75%    127.750000  42.000000  60.750000  13.750000
max    180.000000  48.000000  75.000000  17.000000

In [6]:
df

    TV  Radio  Newspaper  Sales
0   44     39         45     10
1   17     45         69     12
2  151     41         58     16
3  180     10         58     17
4    8     48         75      7
5   57     32         23     11
6  120     19         11     13
7    8      2          1      4

In [15]:
df_t = df.T

In [16]:
df_t.index

Index(['TV', 'Radio', 'Newspaper', 'Sales'], dtype='object')

In [8]:
df.index

RangeIndex(start=0, stop=8, step=1)

In [10]:
df.columns

Index(['TV', 'Radio', 'Newspaper', 'Sales'], dtype='object')

In [11]:
df['TV']

0     44
1     17
2    151
3    180
4      8
5     57
6    120
7      8
Name: TV, dtype: int64

In [12]:
df['Radio']

0    39
1    45
2    41
3    10
4    48
5    32
6    19
7     2
Name: Radio, dtype: int64

In [13]:
df['Newspaper']

0    45
1    69
2    58
3    58
4    75
5    23
6    11
7     1
Name: Newspaper, dtype: int64

In [14]:
df['Sales']

0    10
1    12
2    16
3    17
4     7
5    11
6    13
7     4
Name: Sales, dtype: int64

## Get columns

In [18]:
df.index

RangeIndex(start=0, stop=8, step=1)

In [19]:
df['TV']

0     44
1     17
2    151
3    180
4      8
5     57
6    120
7      8
Name: TV, dtype: int64

In [20]:
df['Radio']

0    39
1    45
2    41
3    10
4    48
5    32
6    19
7     2
Name: Radio, dtype: int64

In [21]:
type(df['Radio'])

pandas.core.series.Series

In [22]:
type(df['Radio'].to_numpy())

numpy.ndarray

In [23]:
df['Radio'].to_numpy()

array([39, 45, 41, 10, 48, 32, 19,  2], dtype=int64)

## Sorting

In [25]:
df.sort_values('Sales')

    TV  Radio  Newspaper  Sales
7    8      2          1      4
4    8     48         75      7
0   44     39         45     10
5   57     32         23     11
1   17     45         69     12
6  120     19         11     13
2  151     41         58     16
3  180     10         58     17

In [17]:
s_df = df.sort_values(['Newspaper', 'Sales'])
s_df

    TV  Radio  Newspaper  Sales
7    8      2          1      4
6  120     19         11     13
5   57     32         23     11
0   44     39         45     10
2  151     41         58     16
3  180     10         58     17
1   17     45         69     12
4    8     48         75      7

In [19]:
s_df.reset_index()

   index   TV  Radio  Newspaper  Sales
0      7    8      2          1      4
1      6  120     19         11     13
2      5   57     32         23     11
3      0   44     39         45     10
4      2  151     41         58     16
5      3  180     10         58     17
6      1   17     45         69     12
7      4    8     48         75      7

## Add column

In [3]:
import pandas as pd

df = pd.read_csv('advertising_simple.csv')
df

    TV  Radio  Newspaper  Sales
0   44     39         45     10
1   17     45         69     12
2  151     41         58     16
3  180     10         58     17
4    8     48         75      7
5   57     32         23     11
6  120     19         11     13
7    8      2          1      4

In [34]:
df['ID'] = list(range(2, 10))
df

    TV  Radio  Newspaper  Sales  ID
0   44     39         45     10   2
1   17     45         69     12   3
2  151     41         58     16   4
3  180     10         58     17   5
4    8     48         75      7   6
5   57     32         23     11   7
6  120     19         11     13   8
7    8      2          1      4   9

In [35]:
df = df.set_index('ID')
df

     TV  Radio  Newspaper  Sales
ID
2    44     39         45     10
3    17     45         69     12
4   151     41         58     16
5   180     10         58     17
6     8     48         75      7
7    57     32         23     11
8   120     19         11     13
9     8      2          1      4

In [5]:
df.drop('Sales', axis=1)

    TV  Radio  Newspaper
0   44     39         45
1   17     45         69
2  151     41         58
3  180     10         58
4    8     48         75
5   57     32         23
6  120     19         11
7    8      2          1

In [6]:
df.drop(1)

    TV  Radio  Newspaper  Sales
0   44     39         45     10
2  151     41         58     16
3  180     10         58     17
4    8     48         75      7
5   57     32         23     11
6  120     19         11     13
7    8      2          1      4

In [7]:
df.drop([1, 2, 3])

    TV  Radio  Newspaper  Sales
0   44     39         45     10
4    8     48         75      7
5   57     32         23     11
6  120     19         11     13
7    8      2          1      4

## get values

In [8]:
import pandas as pd

df = pd.read_csv('advertising_simple.csv')
df

    TV  Radio  Newspaper  Sales
0   44     39         45     10
1   17     45         69     12
2  151     41         58     16
3  180     10         58     17
4    8     48         75      7
5   57     32         23     11
6  120     19         11     13
7    8      2          1      4

In [9]:
df.Radio

0    39
1    45
2    41
3    10
4    48
5    32
6    19
7     2
Name: Radio, dtype: int64

In [12]:
df['Radio']

0    39
1    45
2    41
3    10
4    48
5    32
6    19
7     2
Name: Radio, dtype: int64

In [13]:
df[['Radio', 'Sales']]

   Radio  Sales
0     39     10
1     45     12
2     41     16
3     10     17
4     48      7
5     32     11
6     19     13
7      2      4

In [17]:
df[1:2]

   TV  Radio  Newspaper  Sales
1  17     45         69     12

In [23]:
df[1:4:2]

    TV  Radio  Newspaper  Sales
1   17     45         69     12
3  180     10         58     17